
export const WORK_TYPES = [
  { id: 1, name: 'Реферат' },
  { id: 2, name: 'Курсовая работа' },
  { id: 3, name: 'Лабораторная работа' },
  { id: 4, name: 'Контрольная работа' },
  { id: 5, name: 'Дипломная работа' },
  { id: 6, name: 'Решение задач' },
  { id: 7, name: 'Эссе' },
  { id: 8, name: 'Презентация' },
  { id: 9, name: 'Отчет' },
  { id: 10, name: 'Статья' },
  { id: 11, name: 'Доклад' },
  { id: 12, name: 'Чертеж' },
  { id: 13, name: 'Перевод' },
  { id: 14, name: 'Бизнес-план' },
];
